NIkir0LL/lacert-crypto-esp32/sdkconfig.defaults.esp32c6
# XIAO ESP32-C6 (RISC-V, 160 МГц, одно ядро, флеш 4 МБ).
CONFIG_IDF_TARGET="esp32c6"

# У C6 есть аппаратный ускоритель эллиптических кривых (ECC), которого нет у
# ESP32-S3. Именно он делает подпись ECDSA P-256 на C6 в разы быстрее, несмотря
# на более слабый процессор. Включаем явно, чтобы это было воспроизводимо.
CONFIG_MBEDTLS_HARDWARE_ECC=y
